driver-tests/bpelse/assign/AssignJbi/test/echoConvert_Invoke/archive/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ech="http://stc.com/echoConvert">
  <soapenv:Body>
    <ech:item>
      <ech:inputIntValue>3</ech:inputIntValue>
    </ech:item>
  </soapenv:Body>
</soapenv:Envelope>